Revit 2024 API
ExportTextQualifier Enumeration
 Options for the text qualifier character in schedule view export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum ExportTextQualifier
Visual Basic
Public Enumeration ExportTextQualifier
Visual C++
public enum class ExportTextQualifier
Members
Member name | Description
None |  No text qualifier.
Quote |  The quote character - ' - is used to qualify text.
DoubleQuote |  The quote character - " - is used to qualify text.
See Also
Autodesk.Revit.DB Namespace